zephyrproject-rtos/hal_nxp/s32/mcux/devices/S32K148/S32K148_device.h
/*! @name PCCCR - Cache control register */
/*! @{ */

/* ENWRBUF - Enable Write Buffer is not available on this SoC */
#define LMEM_PCCCR_ENWRBUF_MASK                  (0U)
#define LMEM_PCCCR_ENWRBUF_SHIFT                 (0U)
#define LMEM_PCCCR_ENWRBUF(x)                    (((uint32_t)(((uint32_t)(x)) << LMEM_PCCCR_ENWRBUF_SHIFT)) & LMEM_PCCCR_ENWRBUF_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group LMEM_Register_Masks */

/* LMEM - Peripheral instance base addresses */
/** Peripheral LMEM base address */
#define LMEM_BASE                                IP_LMEM_BASE
/** Peripheral LMEM base pointer */
#define LMEM                                     IP_LMEM
/** Array initializer of LMEM peripheral base addresses */
#define LMEM_BASE_ADDRS                          IP_LMEM_BASE_ADDRS
/** Array initializer of LMEM peripheral base pointers */
#define LMEM_BASE_PTRS                           IP_LMEM_BASE_PTRS

/*!
 * @}
 */ /* end of group LMEM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- FTM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Peripheral_Access_Layer FTM Peripheral Access Layer
 * @{
 */

/* FTM - Peripheral instance base addresses */
/** Peripheral FTM0 base address */
#define FTM0_BASE                                IP_FTM0_BASE
/** Peripheral FTM0 base pointer */
#define FTM0                                     IP_FTM0
/** Peripheral FTM1 base address */
#define FTM1_BASE                                IP_FTM1_BASE
/** Peripheral FTM1 base pointer */
#define FTM1                                     IP_FTM1
/** Peripheral FTM2 base address */
#define FTM2_BASE                                IP_FTM2_BASE
/** Peripheral FTM2 base pointer */
#define FTM2                                     IP_FTM2
/** Peripheral FTM3 base address */
#define FTM3_BASE                                IP_FTM3_BASE
/** Peripheral FTM3 base pointer */
#define FTM3                                     IP_FTM3
/** Peripheral FTM4 base address */
#define FTM4_BASE                                IP_FTM4_BASE
/** Peripheral FTM4 base pointer */
#define FTM4                                     IP_FTM4
/** Peripheral FTM5 base address */
#define FTM5_BASE                                IP_FTM5_BASE
/** Peripheral FTM5 base pointer */
#define FTM5                                     IP_FTM5
/** Peripheral FTM6 base address */
#define FTM6_BASE                                IP_FTM6_BASE
/** Peripheral FTM6 base pointer */
#define FTM6                                     IP_FTM6
/** Peripheral FTM7 base address */
#define FTM7_BASE                                IP_FTM7_BASE
/** Peripheral FTM7 base pointer */
#define FTM7                                     IP_FTM7
/** Array initializer of FTM peripheral base addresses */
#define FTM_BASE_ADDRS                           IP_FTM_BASE_ADDRS
/** Array initializer of FTM peripheral base pointers */
#define FTM_BASE_PTRS                            IP_FTM_BASE_PTRS

/*!
 * @}
 */ /* end of group FTM_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- CAN Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAN_Peripheral_Access_Layer CAN Peripheral Access Layer
 * @{
 */

/* CAN - Peripheral instance base addresses */
/** Peripheral CAN_0 base address */
#define CAN0_BASE                                IP_FLEXCAN0_BASE
/** Peripheral CAN_0 base pointer */
#define CAN0                                     IP_FLEXCAN0
/** Peripheral CAN_1 base address */
#define CAN1_BASE                                IP_FLEXCAN1_BASE
/** Peripheral CAN_1 base pointer */
#define CAN1                                     IP_FLEXCAN1
/** Peripheral CAN_2 base address */
#define CAN2_BASE                                IP_FLEXCAN2_BASE
/** Peripheral CAN_2 base pointer */
#define CAN2                                     IP_FLEXCAN2
/** Array initializer of CAN peripheral base addresses */
#define CAN_BASE_ADDRS                           IP_FLEXCAN_BASE_ADDRS
/** Array initializer of CAN peripheral base pointers */
#define CAN_BASE_PTRS                            IP_FLEXCAN_BASE_PTRS
/** Interrupt vectors for the CAN peripheral type */
#define CAN_Rx_Warning_IRQS                      { CAN0_ORed_IRQn, CAN1_ORed_IRQn, CAN2_ORed_IRQn }
#define CAN_Tx_Warning_IRQS                      { CAN0_ORed_IRQn, CAN1_ORed_IRQn, CAN2_ORed_IRQn }
#define CAN_Wake_Up_IRQS                         { CAN0_Wake_Up_IRQn, NotAvail_IRQn, NotAvail_IRQn }
#define CAN_Error_IRQS                           { CAN0_Error_IRQn, CAN1_Error_IRQn, CAN2_Error_IRQn }
#define CAN_Bus_Off_IRQS                         { CAN0_ORed_IRQn, CAN1_ORed_IRQn, CAN2_ORed_IRQn }
#define CAN_ORed_Message_buffer_0_15_IRQS        { CAN0_ORed_0_15_MB_IRQn, CAN1_ORed_0_15_MB_IRQn, CAN2_ORed_0_15_MB_IRQn }
#define CAN_ORed_Message_buffer_16_31_IRQS       { CAN0_ORed_16_31_MB_IRQn, CAN1_ORed_16_31_MB_IRQn, CAN2_ORed_16_31_MB_IRQn }
#define CAN_ORed_Message_buffer_IRQS             { CAN0_ORed_IRQn, CAN1_ORed_IRQn, CAN2_ORed_IRQn }

/*!
 * @}
 */ /* end of group CAN_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- WDOG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup WDOG_Peripheral_Access_Layer WDOG Peripheral Access Layer
 * @{
 */

 /* WDOG - Peripheral instance base addresses */
/** Peripheral WDOG base address */
#define WDOG_BASE                                IP_WDOG_BASE
/** Peripheral WDOG base pointer */
#define WDOG                                     IP_WDOG
/** Array initializer of WDOG peripheral base addresses */
#define WDOG_BASE_ADDRS                          IP_WDOG_BASE_ADDRS
/** Array initializer of WDOG peripheral base pointers */
#define WDOG_BASE_PTRS                           IP_WDOG_BASE_PTRS
/** Interrupt vectors for the WDOG peripheral type */
#define WDOG_IRQS                                { WDOG_EWM_IRQn }
#define WDOG_UPDATE_KEY                          (0xD928C520U)
#define WDOG_REFRESH_KEY                         (0xB480A602U)

/*!
 * @}
 */ /* end of group WDOG_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- RTC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RTC_Peripheral_Access_Layer RTC Peripheral Access Layer
 * @{
 */

/* RTC - Peripheral instance base addresses */
/** Peripheral RTC base address */
#define RTC_BASE                                 IP_RTC_BASE
/** Peripheral RTC base pointer */
#define RTC                                      IP_RTC
/** Array initializer of RTC peripheral base addresses */
#define RTC_BASE_ADDRS                           IP_RTC_BASE_ADDRS
/** Array initializer of RTC peripheral base pointers */
#define RTC_BASE_PTRS                            IP_RTC_BASE_PTRS
/** Interrupt vectors for the RTC peripheral type */
#define RTC_IRQS                                 { RTC_IRQn }
#define RTC_SECONDS_IRQS                         { RTC_Seconds_IRQn }

/*!
 * @}
 */ /* end of group RTC_Peripheral_Access_Layer */

/* ----------------------------------------------------------------------------
   -- ADC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ADC_Peripheral_Access_Layer ADC Peripheral Access Layer
 * @{
 */

/* ADC - Peripheral instance base addresses */
/** Peripheral ADC0 base address */
#define ADC0_BASE                                IP_ADC0_BASE
/** Peripheral ADC0 base pointer */
#define ADC0                                     IP_ADC0
/** Peripheral ADC1 base address */
#define ADC1_BASE                                IP_ADC1_BASE
/** Peripheral ADC1 base pointer */
#define ADC1                                     IP_ADC1
/** Array initializer of ADC peripheral base addresses */
#define ADC_BASE_ADDRS                           IP_ADC_BASE_ADDRS
/** Array initializer of ADC peripheral base pointers */
#define ADC_BASE_PTRS                            IP_ADC_BASE_PTRS
/** Interrupt vectors for the ADC peripheral type */
#define ADC_IRQS                                 { ADC0_IRQn, ADC1_IRQn }

/*!
 * @}
 */ /* end of group ADC_Peripheral_Access_Layer */

 /* ----------------------------------------------------------------------------
   -- ENET Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENET_Peripheral_Access_Layer ENET Peripheral Access Layer
 * @{
 */

 /* ENET - Peripheral instance base addresses */
/** Peripheral ENET base address */
#define ENET_BASE                                IP_ENET_BASE
/** Peripheral ENET base pointer */
#define ENET                                     IP_ENET
/** Array initializer of ENET peripheral base addresses */
#define ENET_BASE_ADDRS                          IP_ENET_BASE_ADDRS
/** Array initializer of ENET peripheral base pointers */
#define ENET_BASE_PTRS                           IP_ENET_BASE_PTRS
/** Interrupt vectors for the ENET peripheral type */
#define ENET_Transmit_IRQS                       { ENET_TX_Buffer_IRQn }
#define ENET_Receive_IRQS                        { ENET_RX_Buffer_IRQn }
#define ENET_Error_IRQS                          { ENET_PRE_IRQn }
#define ENET_1588_Timer_IRQS                     { ENET_Timer_IRQn }
#define ENET_Ts_IRQS                             { ENET_Timer_IRQn }
/* ENET Buffer Descriptor and Buffer Address Alignment. */
#define ENET_BUFF_ALIGNMENT                      (16U)

/*!
 * @}
 */ /* end of group ENET_Peripheral_Access_Layer */

#endif /* _S32K148_DEVICE_H_ */
